[
  {
    "id": "0",
    "title": "Full Stack Developer",
    "company": "Reach Creative",
    "description": "In my current position, I specialize in the development of components and pages for cutting-edge Next.js web applications. I leverage sophisticated CMS platforms, including Prismic and Sanity, to elevate web development projects, ensuring they are both dynamic and content-rich. My role involves close collaboration with design teams, focusing on the seamless integration of visual concepts with web functionalities. This synergy between design and development guarantees that the final products not only meet but exceed user expectations, providing an intuitive and engaging user experience.",
    "timePeriod": "January 2024 - Present",
    "img": "images/reach.jpg"
  },
  {
    "id": "1",
    "title": "Junior Software Developer",
    "company": "IBG Software",
    "description": "At IBG Software, I led full-stack development in an Agile environment, focusing on React and React Native applications powered by TypeScript, Node.js, and Express.js. My work significantly enhanced project efficiency and execution. My strategic use of MongoDB and Firebase Firestore boosted backend performance. I redefined user experiences by integrating Firebase Authentication with Redux Saga, improving both security and usability. Through Cypress, I implemented end-to-end testing protocols, ensuring software quality. I developed scalable RESTful APIs to improve system performance and meticulously documented processes on Confluence, enhancing team collaboration. Engaging with stakeholders, I aligned products with business objectives, increasing satisfaction. My management of project tasks via Jira facilitated collaboration and ensured the timely completion of milestones.",
    "timePeriod": "November 2022 - January 2024",
    "img": "images/ibg.png"
  },
  {
    "id": "2",
    "title": "Software Developer",
    "company": "Chingu",
    "description": "During Chingu's Voyage 41, our team developed an accessible travel planning app focused on accessibility. In a separate week-long sprint, my partner and I built a Pomodoro Clock application, enhancing collaboration, time management, and React skills through Agile methods.",
    "timePeriod": "October 2022 - November 2022 & March 2023",
    "img": "images/chingu.png"
  }
]