[
  {
    "id": "1",
    "title": "Robotics Teacher",
    "company": "ECISD",
    "description": "I taught six sections of robotics to 7th and 8th-grade students. The curriculum included basic computer science and robotics concepts, using lessons from Code.org and LEGO Education. I engaged students in daily hands-on learning by implementing the engineering/problem-solving process. My experience with robots and circuit boards includes Ozobots, BBC micro:bit, and the Spike Prime LEGO set.",
    "timePeriod": "August 2021 - July 2022",
    "img": "images/ecisd.png"
  },
  {
    "id": "2",
    "title": "Elementary Music Specialist",
    "company": "ECISD",
    "description": "I facilitated weekly general music instruction for students from Pre-Kindergarten through to 5th grade. I also pioneered an after-school guitar club and piano club, which were offered to 4th and 5th-grade students. Additionally, I served as an Innovation Campus Ambassador.",
    "timePeriod": "August 2019 - July 2021",
    "img": "images/ecisd.png"
  },
  {
    "id": "3",
    "title": "AIM Technician",
    "company": "Southwest Conservation Corps",
    "description": "As a Stream Habitat Assessment Technician, in partnership with the Bureau of Land Management (BLM), I assisted with the implementation of the aquatic Assessment, Inventory, Monitoring (AIM) initiative. I sampled twelve random streams and rivers throughout New Mexico, all located on BLM land. The data collected included water sampling, invasive and native plant species identification, EPT taxa sampling, and measurement of various metrics related to the bodies of water.",
    "timePeriod": "April 2018 - October 2018",
    "img": "images/scc.png"
  },
  {
    "id": "4",
    "title": "Trail Worker",
    "company": "California Conservation Corps",
    "description": "Selected for the 2017 season in the Backcountry Trails Program, I maintained trails in the Trinity Alps Wilderness to ensure safe public access. Projects undertaken included the construction of rock walls, water bars, steps, logging, and treading new trails. The tools I used in these tasks included a Pulaski, crosscut saw, loppers, rogue hoes, McLeod, and shovel. Additionally, I performed Kitchen Patrol (KP) duties on a rotational basis, which involved preparing food for a crew of 17 members.",
    "timePeriod": "May 2017 - September 2017",
    "img": "images/ccc.png"
  },
  {
    "id": "5",
    "title": "Teaching Assistant",
    "company": "The University of Texas at El Paso",
    "description": "I taught labs, including Ecology, Organismal Biology, Invertebrate Zoology, General Biology, and Field Biology. My responsibilities included preparing lessons, setting up labs, creating quizzes, grading all assignments, and arranging overnight field trips. Additionally, I worked closely with tenured professors to ensure accurate delivery of the curriculum.",
    "timePeriod": "Fall 2014 - Spring 2017",
    "img": "images/utep.png"
  },
  {
    "id": "6",
    "title": "Graduate Field Researcher",
    "company": "The University of Texas at El Paso",
    "description": "I collected grasshopper specimens bi-monthly at specified locations on IMRS. I also conducted plant surveys using modified quadrats and the belt transect method. Additionally, I assisted colleagues in processing, marking, and recapturing both venomous and non-venomous snakes, as well as a variety of lizards.",
    "timePeriod": "Fall 2014 - Spring 2017",
    "img": "images/utep.png"
  }
]